# Practice 6 - Merchants conversion rate and sales productivity
This notebook uses two tables in the Olist database which are olist_marketing_qualified_leads_dataset (renamed to leads) and olist_closed_deals_dataset (renamed to deals).<br>
Three questions are:

1. **What is the conversion rate each year?**
2. **Which sales representative closed the most deals in 2018?**
3. **Which bussiness segment did Olist has the most deals in 2018?**

## Connect and load in the database

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:***@localhost/olist

'Connected: root@olist'

### Relational Schema <br>
<img src="files/photos/P6.png">

## SQL queries

### Marketing channel and traffic source
In this dataset, we only have landing page as marketing channel. Let's see which landing page has the most signed up merchants.

In [2]:
%%sql
SELECT landing_page_id,
       COUNT(DISTINCT mql_id) AS num_leads
FROM leads
GROUP BY landing_page_id
ORDER BY num_leads DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/olist
10 rows affected.

[('b76ef37428e6799c421989521c0e5077', 912),
 ('22c29808c4f815213303f8933030604c', 883),
 ('58326e62183c14b0c03085c33b9fdc44', 495),
 ('88740e65d5d6b056e0cda098e1ea6313', 445),
 ('ce1a65abd0973638f1c887a6efcfa82d', 394),
 ('40dec9f3d5259a3d2dbcdab2114fae47', 330),
 ('f017be4dbf86243af5c1ebed0cff36a2', 310),
 ('e492ee5eaf1697716985cc6f33f9cd9b', 291),
 ('a7982125ff7aa3b2054c6e44f9d28522', 156),
 ('73f31a40697cc90a86c1273563ac230e', 115)]

Also, let's see how many leads each traffic source has.

In [3]:
%%sql
SELECT origin,
       COUNT(DISTINCT mql_id) AS num_leads
FROM leads
GROUP BY origin
ORDER BY num_leads DESC;

 * mysql+mysqlconnector://root:***@localhost/olist
11 rows affected.

[('organic_search', 2296),
 ('paid_search', 1586),
 ('social', 1350),
 ('unknown', 1099),
 ('direct_traffic', 499),
 ('email', 493),
 ('referral', 284),
 ('other', 150),
 ('display', 118),
 ('other_publicities', 65),
 ('', 60)]

We have missing value and 'unknown' category. The problem is 'unknown' traffic source has a significant number of leads, so Olist should pay attention to that.

### How long does it take to close a deal?
From the first contact date, based on the lead behaviour profile, I would like to know how long the lead decides to become Olist's seller. For more information of the profile, please read [here](https://www.discprofile.com/what-is-disc/overview/) and [answer from Olist](https://www.kaggle.com/olistbr/marketing-funnel-olist/discussion/72388).

In [4]:
%%sql
SELECT lead_behaviour_profile,
       ROUND(AVG(days_diff),0) AS median_days_diff
FROM (SELECT ROW_NUMBER()
             OVER(PARTITION BY t1.lead_behaviour_profile
             ORDER BY t1.days_diff DESC) AS count_of_group,
             t1.lead_behaviour_profile, t1.days_diff, t2.total_of_group
      FROM (SELECT lead_behaviour_profile,
                   TIMESTAMPDIFF(day,first_contact_date,won_date)
                   AS days_diff
            FROM leads l JOIN deals d
            ON l.mql_id = d.mql_id) t1
      JOIN (SELECT lead_behaviour_profile,
                   COUNT(days_diff) AS total_of_group
            FROM (SELECT lead_behaviour_profile,
                         TIMESTAMPDIFF(day,first_contact_date,won_date)
                         AS days_diff
                  FROM leads l JOIN deals d
                  ON l.mql_id = d.mql_id) t1
            GROUP BY lead_behaviour_profile) t2
      ON t1.lead_behaviour_profile = t2.lead_behaviour_profile) t3
WHERE count_of_group BETWEEN total_of_group/2 AND total_of_group/2 + 1
GROUP BY lead_behaviour_profile
ORDER BY median_days_diff DESC;

 * mysql+mysqlconnector://root:***@localhost/olist
10 rows affected.

[('shark, wolf', Decimal('341')),
 ('eagle, cat', Decimal('203')),
 ('shark, cat', Decimal('181')),
 ('cat, wolf', Decimal('160')),
 ('eagle, wolf', Decimal('97')),
 ('wolf', Decimal('36')),
 ('', Decimal('15')),
 ('shark', Decimal('14')),
 ('cat', Decimal('13')),
 ('eagle', Decimal('10'))]

It seems mixed profile leads are much harder to negotiate.

### Merchants conversion rate
The conversion rate reflect the percentage of signed-up merchants that later become Olist sellers. First, let's see the number of leads and closed deals over time.

In [5]:
%%sql
SELECT COALESCE(a.period,b.period) AS period,
       COALESCE(num_leads,0) AS num_new_leads,
       COALESCE(num_deals,0) AS num_deals
FROM (SELECT CONCAT(YEAR(first_contact_date),'-',MONTH(first_contact_date))
             AS period,
             COUNT(DISTINCT mql_id) AS num_leads
      FROM leads
      GROUP BY period
      ORDER BY YEAR(first_contact_date),MONTH(first_contact_date)) a
LEFT JOIN
     (SELECT CONCAT(YEAR(won_date),'-',MONTH(won_date))
             AS period,
             COUNT(DISTINCT mql_id) AS num_deals
      FROM deals
      GROUP BY period
      ORDER BY YEAR(won_date),MONTH(won_date)) b
ON a.period = b.period
UNION
SELECT COALESCE(a.period,b.period) AS period,
       COALESCE(num_leads,0) AS num_new_leads,
       COALESCE(num_deals,0) AS num_deals
FROM (SELECT CONCAT(YEAR(first_contact_date),'-',MONTH(first_contact_date))
             AS period,
             COUNT(DISTINCT mql_id) AS num_leads
      FROM leads
      GROUP BY period
      ORDER BY YEAR(first_contact_date),MONTH(first_contact_date)) a
RIGHT JOIN
     (SELECT CONCAT(YEAR(won_date),'-',MONTH(won_date))
             AS period,
             COUNT(DISTINCT mql_id) AS num_deals
      FROM deals
      GROUP BY period
      ORDER BY YEAR(won_date),MONTH(won_date)) b
ON a.period = b.period;

 * mysql+mysqlconnector://root:***@localhost/olist
18 rows affected.

[('2017-6', 4, 0),
 ('2017-7', 239, 0),
 ('2017-8', 386, 0),
 ('2017-9', 312, 0),
 ('2017-10', 416, 0),
 ('2017-11', 445, 0),
 ('2017-12', 200, 3),
 ('2018-1', 1141, 73),
 ('2018-2', 1028, 113),
 ('2018-3', 1174, 147),
 ('2018-4', 1352, 207),
 ('2018-5', 1303, 122),
 ('2018-6', 0, 57),
 ('2018-7', 0, 37),
 ('2018-8', 0, 33),
 ('2018-9', 0, 23),
 ('2018-10', 0, 21),
 ('2018-11', 0, 6)]

Here, we can see that even though the leads had signed up from June 2017, but until December 2017 did they become sellers. The query below calculates the conversion rate in 2018 and 2017.

In [6]:
%%sql
SELECT a.year, num_deals, num_leads,
       ROUND(num_deals/num_leads*100,2) AS conversion_rate
FROM (SELECT YEAR(first_contact_date) AS year,
             COUNT(DISTINCT mql_id) AS num_leads
      FROM leads
      GROUP BY year) a
JOIN (SELECT YEAR(won_date) AS year,
             COUNT(DISTINCT mql_id) AS num_deals
      FROM deals
      GROUP BY year) b
ON a.year = b.year;

 * mysql+mysqlconnector://root:***@localhost/olist
2 rows affected.

[(2017, 3, 2002, Decimal('0.15')), (2018, 839, 5998, Decimal('13.99'))]

The conversion rate in 2017 is very low as we might see in the previous query. In 2018, the conversion rate is still low. I would like to see how the conversion rate is different when it's come to different leads traffic source origin.

In [7]:
%%sql
SELECT origin,
       SUM(year_2017) AS conversion_rate_2017,
       SUM(year_2018) AS conversion_rate_2018
FROM (SELECT a.origin,
             IF(a.year = 2017,ROUND(num_deals/num_leads*100,2),0)
             AS year_2017,
             IF(a.year = 2018,ROUND(num_deals/num_leads*100,2),0)
             AS year_2018
      FROM (SELECT YEAR(first_contact_date) AS year, origin,
                   COUNT(DISTINCT mql_id) AS num_leads
            FROM leads
            GROUP BY year, origin) a
      JOIN (SELECT YEAR(won_date) AS year, origin,
                   COUNT(DISTINCT d.mql_id) AS num_deals
            FROM deals d JOIN leads l
            ON d.mql_id = l.mql_id
            GROUP BY year, origin) b
      ON a.year = b.year
      AND a.origin = b.origin) c
GROUP BY origin
ORDER BY conversion_rate_2018 DESC;

 * mysql+mysqlconnector://root:***@localhost/olist
11 rows affected.

[('', Decimal('0.00'), Decimal('29.17')),
 ('unknown', Decimal('0.00'), Decimal('22.02')),
 ('paid_search', Decimal('0.50'), Decimal('16.33')),
 ('organic_search', Decimal('0.00'), Decimal('15.61')),
 ('direct_traffic', Decimal('0.00'), Decimal('14.74')),
 ('referral', Decimal('0.00'), Decimal('11.37')),
 ('other_publicities', Decimal('0.00'), Decimal('7.32')),
 ('social', Decimal('0.00'), Decimal('7.14')),
 ('display', Decimal('2.33'), Decimal('6.67')),
 ('email', Decimal('0.00'), Decimal('4.32')),
 ('other', Decimal('0.00'), Decimal('3.51'))]

Besides the missing value, 'unknown' source has the highest rate. Again, Olist should find out the missing information and focus on these kind of traffic source to see if it can help improve the conversion rate.

### Top sales by sales rep and business segment
Now, let's find which sales representative has the most closed deal each month in 2018.

In [8]:
%%sql
SELECT month, sr_id, num_deals
FROM (SELECT MONTH(won_date) AS month,
             sr_id,
             COUNT(DISTINCT mql_id) AS num_deals,
             RANK() OVER(PARTITION BY MONTH(won_date)
                         ORDER BY COUNT(DISTINCT mql_id) DESC)
             AS sales_rank
       FROM deals
       WHERE YEAR(won_date) = 2018
       GROUP BY month, sr_id) a
WHERE sales_rank = 1;

 * mysql+mysqlconnector://root:***@localhost/olist
12 rows affected.

[(1, '4ef15afb4b2723d8f3d81e51ec7afefe', 18),
 (2, '4ef15afb4b2723d8f3d81e51ec7afefe', 25),
 (3, '4ef15afb4b2723d8f3d81e51ec7afefe', 22),
 (4, '4ef15afb4b2723d8f3d81e51ec7afefe', 33),
 (5, '4ef15afb4b2723d8f3d81e51ec7afefe', 18),
 (6, '4ef15afb4b2723d8f3d81e51ec7afefe', 10),
 (7, '4b339f9567d060bcea4f5136b9f5949e', 5),
 (7, '85fc447d336637ba1df43e793199fbc8', 5),
 (8, '068066e24f0c643eb1d089c7dd20cd73', 5),
 (9, 'de63de0d10a6012430098db33c679b0b', 5),
 (10, '068066e24f0c643eb1d089c7dd20cd73', 5),
 (11, '34d40cdaf94010a1d05b0d6212f9e909', 2)]

Sales rep '4ef15afb4b2723d8f3d81e51ec7afefe' seems very promising here. He brought in the most deals in the first 2 quarters. How about number of deals by business segment?

In [9]:
%%sql
SELECT month, business_segment, num_deals
FROM (SELECT MONTH(won_date) AS month,
             business_segment,
             COUNT(DISTINCT mql_id) AS num_deals,
             RANK() OVER(PARTITION BY MONTH(won_date)
                         ORDER BY COUNT(DISTINCT mql_id) DESC)
             AS sales_rank
       FROM deals
       WHERE YEAR(won_date) = 2018
       GROUP BY month, business_segment) a
WHERE sales_rank = 1;

 * mysql+mysqlconnector://root:***@localhost/olist
14 rows affected.

[(1, 'home_decor', 13),
 (2, 'car_accessories', 12),
 (2, 'home_decor', 12),
 (3, 'home_decor', 18),
 (4, 'home_decor', 29),
 (5, 'health_beauty', 20),
 (6, 'audio_video_electronics', 7),
 (7, 'home_decor', 6),
 (8, 'home_decor', 6),
 (9, 'construction_tools_house_garden', 5),
 (10, 'construction_tools_house_garden', 3),
 (10, 'home_decor', 3),
 (10, 'household_utilities', 3),
 (11, 'other', 3)]

We have home decoration business mostly in top sales each month.